# Pandas
* Pandas is an open source library built on top of Numpy
* It allows for fast analysis and data cleaning and data preparation
* It excels in performance and productivity
* It also has built in visualiztion features
* It can work with data from a wide variety of sources.

# Install
`conda install pandas`  
`pip install pandas`

# Series
Series is one-dimensional labeled array capable of holding data of any type  
`pandas.Series(data, index, dtype, copy)`

In [2]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)

In [3]:
arr

array([10, 20, 30])

In [4]:
pd.Series(data=my_data) # creating series from list

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=my_data, index=labels) # creating Series from list with labels

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_data, labels) # data, and index can be ignored to write

a    10
b    20
c    30
dtype: int64

In [7]:
d = {'a': 10, 'b': 20, 'c':30}
pd.Series(d) # creating Series with dictionary

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(labels) # Series can takes any object types here string

0    a
1    b
2    c
dtype: object

In [15]:
ser1 = pd.Series([1, 2, 3, 4], ['India', 'Germany', 'USA', 'Japan'])

In [16]:
ser1

India      1
Germany    2
USA        3
Japan      4
dtype: int64

In [11]:
ser2 = pd.Series([1,2, 5, 4], ['India', 'Germany', 'Italy', 'Japan'])

In [12]:
ser2

India      1
Germany    2
Italy      5
Japan      4
dtype: int64

In [17]:
ser1['India'] # getting particular data from series

1

In [18]:
ser1

India      1
Germany    2
USA        3
Japan      4
dtype: int64

In [19]:
ser2

India      1
Germany    2
Italy      5
Japan      4
dtype: int64

In [20]:
ser1 + ser2

Germany    4.0
India      2.0
Italy      NaN
Japan      8.0
USA        NaN
dtype: float64

# DataFrames
DataFrame is 2-Dimensional data structure, it can be aligned in tabular fashion in rows and columns
### Features:
* Potentially columns are of different types
* Size - mutable 
* Labeled Axes(rows and column)
* Can perform arithmatic operation on rows and columns  
`pandas.DataFrame(data, row_label, column_label)`  
by default row_label and column_label is range(n)

# Creating DataFrames
A Data frames can be created using various inputs like:
* Lists
* dict
* Series
* Numpy ndarrays
* Another DatFrame

In [4]:
from numpy.random import randn

In [23]:
df = pd.DataFrame() # Empty Data frame
print(df)

Empty DataFrame
Columns: []
Index: []

In [25]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [28]:
df

          W         X         Y         Z
A -0.308692 -1.252830  1.814700  2.034932
B -1.326599  0.652131 -2.493576 -0.752748
C -1.426276 -1.749004 -0.831166 -0.718000
D  0.098200 -0.737745 -0.255572 -0.047752
E -1.270037  0.209827 -0.262292 -0.200519

In [55]:
# COLUMN SELECTION

In [29]:
df['W'] # fetching single column

A   -0.308692
B   -1.326599
C   -1.426276
D    0.098200
E   -1.270037
Name: W, dtype: float64

In [30]:
type(df['W']) # It's a series so Data Frames is bunch of series sharing the same indexes

pandas.core.series.Series

In [33]:
df[['W', 'Y']] # Fetching multiple columns

          W         Y
A -0.308692  1.814700
B -1.326599 -2.493576
C -1.426276 -0.831166
D  0.098200 -0.255572
E -1.270037 -0.262292

In [34]:
type(df[['W', 'Y']])

pandas.core.frame.DataFrame

In [46]:
df['new'] = df['W'] + df['Y'] # adding new column

In [36]:
df

          W         X         Y         Z       new
A -0.308692 -1.252830  1.814700  2.034932  1.506008
B -1.326599  0.652131 -2.493576 -0.752748 -3.820175
C -1.426276 -1.749004 -0.831166 -0.718000 -2.257442
D  0.098200 -0.737745 -0.255572 -0.047752 -0.157372
E -1.270037  0.209827 -0.262292 -0.200519 -1.532329

In [47]:
df.drop('new', axis=1) # droping single column, this is not inplace delete it returns the deleted dataframe

          W         X         Y         Z
A -0.308692 -1.252830  1.814700  2.034932
B -1.326599  0.652131 -2.493576 -0.752748
C -1.426276 -1.749004 -0.831166 -0.718000
D  0.098200 -0.737745 -0.255572 -0.047752
E -1.270037  0.209827 -0.262292 -0.200519

In [48]:
df # df remains unchanged

          W         X         Y         Z       new
A -0.308692 -1.252830  1.814700  2.034932  1.506008
B -1.326599  0.652131 -2.493576 -0.752748 -3.820175
C -1.426276 -1.749004 -0.831166 -0.718000 -2.257442
D  0.098200 -0.737745 -0.255572 -0.047752 -0.157372
E -1.270037  0.209827 -0.262292 -0.200519 -1.532329

In [49]:
df.drop('new', axis=1, inplace=True) # this is inplace drop, axis=0 means rows and axis=1 means columns

In [50]:
df # this time df changed

          W         X         Y         Z
A -0.308692 -1.252830  1.814700  2.034932
B -1.326599  0.652131 -2.493576 -0.752748
C -1.426276 -1.749004 -0.831166 -0.718000
D  0.098200 -0.737745 -0.255572 -0.047752
E -1.270037  0.209827 -0.262292 -0.200519

In [51]:
df.drop('E', axis=0)

          W         X         Y         Z
A -0.308692 -1.252830  1.814700  2.034932
B -1.326599  0.652131 -2.493576 -0.752748
C -1.426276 -1.749004 -0.831166 -0.718000
D  0.098200 -0.737745 -0.255572 -0.047752

In [60]:
df

          W         X         Y         Z
A -0.308692 -1.252830  1.814700  2.034932
B -1.326599  0.652131 -2.493576 -0.752748
C -1.426276 -1.749004 -0.831166 -0.718000
D  0.098200 -0.737745 -0.255572 -0.047752
E -1.270037  0.209827 -0.262292 -0.200519

In [53]:
df.shape # (row, column)

(5, 4)

In [54]:
# SELECT ROWS

In [57]:
df.loc['A'] # It is also series

W   -0.308692
X   -1.252830
Y    1.814700
Z    2.034932
Name: A, dtype: float64

In [58]:
df.iloc[2] # index based location

W   -1.426276
X   -1.749004
Y   -0.831166
Z   -0.718000
Name: C, dtype: float64

In [59]:
df.loc['B','Y'] # df.loc[row,column]

-2.4935755508407218

In [62]:
df.loc[['A', 'B'], ['W', 'Y']] # df.loc[[rows], [columns]]

          W         Y
A -0.308692  1.814700
B -1.326599 -2.493576

# Conditional selection

In [5]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [6]:
df

          W         X         Y         Z
A -0.845159  0.078865  1.148970 -0.181557
B  2.337382 -1.406143  1.707729 -0.198099
C  1.039041  0.943306  1.835125 -0.531077
D  2.576107 -0.390174 -0.268093  0.695740
E -0.179738  0.295185  0.062697 -0.134936

In [7]:
df > 0 # conditional selection on whole data frame, return a true, false in tabular form

       W      X      Y      Z
A  False   True   True  False
B   True  False   True  False
C   True   True   True  False
D   True  False  False   True
E  False   True   True  False

In [8]:
df[df > 0] # selecting the exact value, return NaN if condition is false

          W         X         Y        Z
A       NaN  0.078865  1.148970      NaN
B  2.337382       NaN  1.707729      NaN
C  1.039041  0.943306  1.835125      NaN
D  2.576107       NaN       NaN  0.69574
E       NaN  0.295185  0.062697      NaN

In [9]:
df['W'] # getting column W

A   -0.845159
B    2.337382
C    1.039041
D    2.576107
E   -0.179738
Name: W, dtype: float64

In [10]:
df['W'] > 0 # getting column W which has value > 0

A    False
B     True
C     True
D     True
E    False
Name: W, dtype: bool

In [11]:
df[df['W'] > 0] # Actual selection of values according to condtion of column

          W         X         Y         Z
B  2.337382 -1.406143  1.707729 -0.198099
C  1.039041  0.943306  1.835125 -0.531077
D  2.576107 -0.390174 -0.268093  0.695740

In [12]:
df[df['W'] > 0]['X'] # selecting a single column

B   -1.406143
C    0.943306
D   -0.390174
Name: X, dtype: float64

In [13]:
df[df['W'] > 0][['X', 'Y']] # selecting multiple column

          X         Y
B -1.406143  1.707729
C  0.943306  1.835125
D -0.390174 -0.268093

In [14]:
df[df['W'] > 0].loc['D']

W    2.576107
X   -0.390174
Y   -0.268093
Z    0.695740
Name: D, dtype: float64

In [15]:
df[df['W'] > 0].loc[['B', 'D']]

          W         X         Y         Z
B  2.337382 -1.406143  1.707729 -0.198099
D  2.576107 -0.390174 -0.268093  0.695740

In [17]:
# Multiple condition

df[(df['W'] > 0) & (df['Y'] > 1)] # Don't use 'and' you'll get an error, use : &, |,

          W         X         Y         Z
B  2.337382 -1.406143  1.707729 -0.198099
C  1.039041  0.943306  1.835125 -0.531077

In [18]:
df

          W         X         Y         Z
A -0.845159  0.078865  1.148970 -0.181557
B  2.337382 -1.406143  1.707729 -0.198099
C  1.039041  0.943306  1.835125 -0.531077
D  2.576107 -0.390174 -0.268093  0.695740
E -0.179738  0.295185  0.062697 -0.134936

In [19]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.845159  0.078865  1.148970 -0.181557
1     B  2.337382 -1.406143  1.707729 -0.198099
2     C  1.039041  0.943306  1.835125 -0.531077
3     D  2.576107 -0.390174 -0.268093  0.695740
4     E -0.179738  0.295185  0.062697 -0.134936

In [20]:
df

          W         X         Y         Z
A -0.845159  0.078865  1.148970 -0.181557
B  2.337382 -1.406143  1.707729 -0.198099
C  1.039041  0.943306  1.835125 -0.531077
D  2.576107 -0.390174 -0.268093  0.695740
E -0.179738  0.295185  0.062697 -0.134936

In [21]:
newindex = 'CA NY WY OR CO'.split()

In [22]:
newindex

['CA', 'NY', 'WY', 'OR', 'CO']

In [23]:
df['States'] = newindex

In [24]:
df

          W         X         Y         Z States
A -0.845159  0.078865  1.148970 -0.181557     CA
B  2.337382 -1.406143  1.707729 -0.198099     NY
C  1.039041  0.943306  1.835125 -0.531077     WY
D  2.576107 -0.390174 -0.268093  0.695740     OR
E -0.179738  0.295185  0.062697 -0.134936     CO

In [25]:
df.set_index('States') # setting new index from column, this is not inplace, set inplace=True to do it inplace

               W         X         Y         Z
States
CA     -0.845159  0.078865  1.148970 -0.181557
NY      2.337382 -1.406143  1.707729 -0.198099
WY      1.039041  0.943306  1.835125 -0.531077
OR      2.576107 -0.390174 -0.268093  0.695740
CO     -0.179738  0.295185  0.062697 -0.134936

In [26]:
df

          W         X         Y         Z States
A -0.845159  0.078865  1.148970 -0.181557     CA
B  2.337382 -1.406143  1.707729 -0.198099     NY
C  1.039041  0.943306  1.835125 -0.531077     WY
D  2.576107 -0.390174 -0.268093  0.695740     OR
E -0.179738  0.295185  0.062697 -0.134936     CO

# Pandas - Missing Data

In [27]:
import numpy as np
import pandas as pd

In [28]:
d = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan],'C':[1, 2, 3]}

In [29]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [30]:
df = pd.DataFrame(d)

In [31]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [32]:
df.dropna() # drop any rows or column with nan, by default axix=0

     A    B  C
0  1.0  5.0  1

In [33]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [35]:
df.dropna(thresh=2) # rows with more than 2 non nan values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [36]:
df.fillna(value='FILL VALUE') # filling nan values

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [38]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# pandas - Groupby 
Groupby allows you to group together rows based off of a column and perform an aggregate function on them

In [39]:
data = {'Company': ['Google', 'Google', 'msft', 'msft', 'fb', 'fb'],
        'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'SAles': [200, 120, 340, 124, 243, 350]}

In [40]:
data

{'Company': ['Google', 'Google', 'msft', 'msft', 'fb', 'fb'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'SAles': [200, 120, 340, 124, 243, 350]}

In [41]:
df = pd.DataFrame(data)

In [42]:
df

  Company   Person  SAles
0  Google      Sam    200
1  Google  Charlie    120
2    msft      Amy    340
3    msft  Vanessa    124
4      fb     Carl    243
5      fb    Sarah    350

In [44]:
by_company = df.groupby('Company') # group by company, return an object

In [45]:
by_company.mean() # pandas ignore non numeric column

         SAles
Company
Google   160.0
fb       296.5
msft     232.0

In [46]:
by_company.std()

              SAles
Company
Google    56.568542
fb        75.660426
msft     152.735065

In [49]:
by_company.sum()

         SAles
Company
Google     320
fb         593
msft       464

In [50]:
by_company.sum().loc['fb']

SAles    593
Name: fb, dtype: int64

In [51]:
by_company.count()

         Person  SAles
Company
Google        2      2
fb            2      2
msft          2      2

In [52]:
by_company.describe()

        SAles
        count   mean         std    min     25%    50%     75%    max
Company
Google    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
fb        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
msft      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Merging, Joining and Concatenating

In [53]:
import pandas as pd

In [54]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [55]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [56]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [57]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [58]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [59]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# Concatenation
Concatenation basically glues together DataFrames. Dimension should match along the axis you are concatenating on.  
`pd.concat([df1, df2, df3])`

In [60]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [61]:
pd.concat([df1, df2, df3], axis=1) # joining column

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Merging
The **merge** function allows you to merge DataFrames together using similar logic as mergin Sql tables together.

In [62]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [63]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [64]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [65]:
pd.merge(left, right, how='inner', on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [66]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [67]:
pd.merge(left, right, on=['key1', 'key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

# Joining 
Joining is convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame

In [68]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [69]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

# Operations

In [70]:
import numpy as np
import pandas as pd

In [73]:
df = pd.DataFrame({'col1': [1, 2, 3, 4],
                'col2': [444, 555, 666, 444],
                'col3': ['abc','def','ghi','xyz']})

In [75]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [77]:
df['col2'].unique() # getting unique value from column2

array([444, 555, 666])

In [78]:
df['col2'].nunique() # getting size of unize values

3

In [80]:
df['col2'].value_counts() # counting repeated value in column2

444    2
555    1
666    1
Name: col2, dtype: int64

In [82]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [84]:
df[(df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [85]:
def times2(x):
    return x*2

In [87]:
df['col1'].apply(times2) # apply custom functions on each element

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [89]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [91]:
df.columns # getting list of columns names

Index(['col1', 'col2', 'col3'], dtype='object')

In [94]:
df.index # getting index values

RangeIndex(start=0, stop=4, step=1)

In [98]:
df.sort_values('col2') # sort values by column, not inplace

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [100]:
df.isnull() # returns True/False in tabular form, wheter value is null or not

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Input and Output with pandas

Pandas has ability to read and write from csv, excel, html, sql etc.

```
conda install sqlalchemy
conda install lxml
conda install html5lib
conda install BeautifulSoup4
```

In [101]:
import pandas as pd

In [104]:
pd.read_csv('example') # reading csv files into dataframes

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [109]:
df = pd.read_csv('example')

In [110]:
df.to_csv('My_output', index=False) # writing dataframe to csv files

In [111]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [113]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1') # read excel files into dataframes

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [115]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet')  # writing dataframes into excel files

In [118]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html') # reading html

In [119]:
type(data)

list

In [122]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"

In [123]:
from sqlalchemy import create_engine

In [124]:
engine = create_engine('sqlite:///:memory:')

In [125]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [126]:
df.to_sql('my_table', engine) # writing dataframe into sql table

In [127]:
sqldf = pd.read_sql('my_table', con=engine) # reading sql table into dataframe

In [128]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15